/**
 * 3章 合成型
 */

package main

import (
	"fmt"
	"maps"
	"slices"
)

func main() {
	// 配列: Goでは配列を直接使うことは少ない
	//   - 配列の各要素は指定された型である必要がある (インターフェイスを考えるとすべてが同じ型であることを意味しない
	{
		var x [3]int
		fmt.Println(x) // [0 0 0]
	}
	// 配列リテラル: 宣言で値を直接指定する
	{
		var x = [3]int{10, 20, 30}
		fmt.Println(x) // [10 20 30]
	}
	// 配列に「空き」があることを指定する場合は，配列のインデックス (添え字) と値を指定できる
	{
		var x = [12]int{1, 5: 4, 6, 10: 100, 15}
		fmt.Println(x) // [1 0 0 0 0 4 6 0 0 0 100 15]
	}
	// 配列リテラルを使って初期化するときは，...によって大きさを省略できる
	{
		var x = [...]int{10, 20, 30}
		fmt.Println(x) // [10 20 30]
	}
	// 配列は==, !=で比較できる
	{
		var x = [...]int{1, 2, 3}
		var y = [3]int{1, 2, 3}
		fmt.Println(x == y) // true
	}
	// 多次元配列: Goには1次元の配列しかないが，配列の配列をつくることで多次元配列を実現できる
	{
		var x [2][3]int // 長さが2の「長さが3のint配列」の配列
		fmt.Println(x)  // [[0 0 0] [0 0 0]]
	}
	// インデックスを指定できる
	{
		var x [3]int
		x[0] = 10
		fmt.Println(x[0]) // 10
	}
	// 長さ以上のインデックスや負のインデックスを与えると，
	//   - インデックスが定数やリテラルならコンパイルエラーになる
	//   - 変数なら実行時パニックになる
	// 組み込み関数lenで配列の長さを取得できる
	{
		x := [...]int{1, 2, 3, 4, 5}
		fmt.Println(len(x)) // 5
	}
	// Goは配列の大きさ(長さ)を型の一部とみなす
	//   * つまり，[3]intと[4]intは異なる型である
	// 配列の型はコンパイル時に決定できる必要がある
	//   * 長さが異なる配列への型変換はできない (相互に変換できない)
	//   * ひとつの変数に異なる長さの配列を代入することはできない
	{
		var x [3]int
		// ↓ はコンパイルできない
		// var y [4]int = x // cannot use x (variable of type [3]int) as [4]int value in variable declaration
		fmt.Println(x)
	}
	// スライス: 可変長の配列のようなもの
	// [n]や[...]と書けば配列だが，単に[]と書けばスライスになる
	{
		var x = []int{10, 20, 30}
		fmt.Println(x) // [10 20 30]
	}
	// スライスリテラルでもインデックスを指定して一部の値だけからなるリテラルを作ることができる
	{
		var x = []int{1, 5: 4, 6, 10: 100, 15}
		fmt.Println(x) // [1 0 0 0 0 4 6 0 0 0 100 15]
	}
	// スライスもインデックスを指定して値を取得・変更できる
	// ただし，インデックスの範囲を超える要素にはアクセスできない
	{
		var x = []int{0, 0, 0}
		x[0] = 10
		fmt.Println(x[2]) // 0
	}
	// 多次元のスライスを作ることもできる
	{
		var x [][]int
		fmt.Println(x) // []
	}
	// nil: スライスのゼロ値
	// 他言語のnull (NULL)とは性質が異なり，Goのnilはいくつかの型で「値がない」ことを表す識別子である
	// nilには型はない
	{
		var x []int
		fmt.Println(x == nil) // true
	}
	// スライスは比較可能ではないので==や!=で比較できないが，nilとの比較はできる
	// ただし，slices.Equal, slices.EqualFuncなどの関数を使ってスライス同士を比較することはできる (長さが同じで，各要素も同じなら等しいとみなす)
	{
		x := []int{1, 2, 3, 4, 5}
		y := []int{1, 2, 3, 4, 5}
		z := []int{1, 2, 3, 4, 5, 6}
		fmt.Println(slices.Equal(x, y)) // true
		fmt.Println(slices.Equal(x, z)) // false

		//s := []string{"a", "b", "c"}
		// ↓ はコンパイルできない
		//fmt.Println(slices.Equal(x, s)) // in call to slices.Equal, type []string of s does not match inferred type []int for S
	}
	// スライスを扱うための組み込み関数
	// len: スライスの長さを取得する
	//   - nilの場合は0を返す
	{
		var x []int = nil
		fmt.Println(len(x)) // 0
	}
	// append: スライスの末尾に要素を追加する
	//  - 複数追加することも出来る
	//  - ...演算子を後置するとスライスの個々の値を展開できる
	//  - appendの戻り値は必ず受け取る必要がある (コンパイルエラーになる)
	{
		var x []int
		x = append(x, 10)
		fmt.Println(x) // [10]

		var y = []int{1, 2, 3}
		y = append(y, 4)
		fmt.Println(y) // [1 2 3 4]

		y = append(y, 5, 6, 7)
		fmt.Println(y) // [1 2 3 4 5 6 7]

		z := []int{20, 30, 40}
		x = append(x, z...)
		fmt.Println(x) // [10 20 30 40]
	}
	// スライスのキャパシティ: スライスはあらかじめ一定量の連続領域をメモリ上に確保しており，その大きさをキャパシティという
	//  - スライスの長さがキャパシティを超えて要素がappendされると，新たに十分な大きさの連続領域が確保され，既存の要素がコピーされる
	//  - 組み込み関数capでスライスの現在のキャパシティを取得できる
	{
		var x []int
		fmt.Println(x, len(x), cap(x)) // [] 0 0
		x = append(x, 10)
		fmt.Println(x, len(x), cap(x)) // [10] 1 1
		x = append(x, 20)
		fmt.Println(x, len(x), cap(x)) // [10 20] 2 2
		x = append(x, 30)
		fmt.Println(x, len(x), cap(x)) // [10 20 30] 3 4
		x = append(x, 40)
		fmt.Println(x, len(x), cap(x)) // [10 20 30 40] 4 4
		x = append(x, 50)
		fmt.Println(x, len(x), cap(x)) // [10 20 30 40 50] 5 8
	}
	// 組み込み関数make: 型や長さ，キャパシティを指定してスライスを作成する
	// - スライスの宣言時にキャパシティを指定するためにはを使う
	{
		x := make([]int, 5)            // 長さ3のスライスを作成
		fmt.Println(x, len(x), cap(x)) // [0 0 0 0 0] 5 5

		y := make([]int, 5, 10)        // 長さ5，キャパシティ10のスライスを作成
		fmt.Println(y, len(y), cap(y)) // [0 0 0 0 0] 5 10

		z := make([]int, 0, 10) // 長さ0，キャパシティ10のスライスを作成
		z = append(z, 5, 6, 7, 8)
		fmt.Println(z, len(z), cap(z)) // [5 6 7 8] 4 10
	}
	// 組み込み関数clear: スライスの全要素をゼロ値にする
	{
		s := []string{"first", "second", "third"}
		fmt.Println(s, len(s)) // [first second third] 3
		clear(s)
		fmt.Println(s, len(s))                                            // [  ] 3
		fmt.Printf("s[0]=|%s|, s[1]=|%s|, s[2]=|%s|\n", s[0], s[1], s[2]) // s[0]:||, s[1]:||, s[2]:||
	}
	// スライスの生成方法の選択: 「いかにスライスのキャパシティを大きくする回数を減らせるか」が重要
	// * スライスが全く大きくならない場合は，var data []intのようにvar宣言とnilスライスを利用する
	// * 初期値がある・スライスの値が変化しない場合は，data := []int{1, 2, 3, 4}のようにスライスリテラルを利用する
	// * 実行時に決まるような場合はmake関数を利用する
	//    - この場合は，長さとキャパシティの指定の仕方が問題になる
	//    1. スライスをバッファとして利用する場合は長さを指定する
	//    2. 必要なサイズがあらかじめわかっている場合には，そのサイズを長さとして指定する
	//    3. そうでない場合は長さ0で，キャパシティを指定する (要素の追加にはappendを使う)

	// スライスの部分を切り出して別のスライスを作ることができる
	// スライス式は[開始オフセット:終了オフセット]の形で書く
	// 開始オフセットを省略すると0，終了オフセットを省略するとスライスの長さになる
	{
		x := []string{"a", "b", "c", "d"}
		y := x[:2]
		z := x[1:]
		d := x[1:3]
		e := x[:]
		fmt.Println("x: ", x) // x:  [a b c d]
		fmt.Println("y: ", y) // y:  [a b]
		fmt.Println("z: ", z) // z:  [b c d]
		fmt.Println("d: ", d) // d:  [b c]
		fmt.Println("e: ", e) // e:  [a b c d]
	}
	// スライスからサブスライスを作るときはコピーをしているわけではなく，同じ記憶領域を参照している
	// したがってサブスライスを変更すると，元のスライスや，元のスライスから作られた他のサブスライスにも影響が及ぶ
	{
		x := []string{"a", "b", "c", "d"}
		y := x[:2]
		z := x[1:]
		x[1] = "y"
		y[0] = "x"
		z[1] = "z"
		fmt.Println("x: ", x) // x:  [x y z d]
		fmt.Println("y: ", y) // y:  [x y]
		fmt.Println("z: ", z) // z:  [y z d]
	}
	// さらにサブスライスにappendで要素を追加すると，元のスライスや他のサブスライスに影響が及ぶことがある
	{
		x := []string{"a", "b", "c", "d"}
		y := x[:2] // y = [a b]だが，cとdもキャパシティに含まれる
		y = append(y, "z")
		y = append(y, "1")
		y = append(y, "2")
		fmt.Println("x: ", x) // x:  [a b z 1]
		fmt.Println("y: ", y) // y:  [a b z 1 2]
	}
	// 混乱してしまうため，サブスライスにはappendを使わないか，フルスライス式を用いてappendで上書きが生じないようにする
	// フルスライス式: [開始オフセット:終了オフセット:キャパシティ]の形でキャパシティを指定する
	{
		x := make([]string, 0, 5)
		x = append(x, "a", "b", "c", "d")
		y := x[:2:2]                        // yが利用できるのは，xの2番目まで
		z := x[2:4:4]                       // zが利用できるのは，xの4番目まで
		fmt.Println(cap(x), cap(y), cap(z)) // 5 2 2
		y = append(y, "i", "j", "k")
		x = append(x, "x")
		z = append(z, "y")
		fmt.Println("x: ", x) // x:  [a b c d x]
		fmt.Println("y: ", y) // y:  [a b i j k]
		fmt.Println("z: ", z) // z:  [c d y]
		// yやzではappendしようとするとキャパシティを超えるため，新しいスライスが作られる (コピーが発生する)
	}
	// サブスライスを作る際は，オリジナルのスライスもサブスライスも変更しないほうが無難である
	// appendを使う場合は，フルスライス式を用いてキャパシティを制限すべきである

	// copy関数: オリジナルとは記憶領域を共有しないスライスを生成する
	// copy(dst, src)の形で使い，戻り値はコピーした要素数である
	{
		x := []int{1, 2, 3, 4}
		y := make([]int, 4)
		num := copy(y, x)   // xからyにコピーする
		fmt.Println(y, num) // [1 2 3 4] 4
	}
	// dstとsrcの長さ(!= キャパシティ)が異なる場合，短いほうの長さ分だけコピーされる
	// dstとsrcが重なっていても正しく動作する
	{
		x := []int{1, 2, 3, 4}
		y := make([]int, 2)
		num1 := copy(y, x)   // 先頭から2要素だけコピーされる
		fmt.Println(y, num1) // [1 2] 2
		z := make([]int, 2)
		// ↓ 戻り値が不要なら受け取る必要はない
		copy(z, x[2:]) // xの3番目の要素から先をコピーする
		fmt.Println(z) // [3 4]
		num2 := copy(x[:3], x[1:])
		// [1 2 3]( 4])
		//  ^ ^ ^
		// [2 3 4]
		fmt.Println(x, num2) // [2 3 4 4] 3
	}
	// 配列のスライスをとると，配列に対してcopy関数を使える (dst, srcどちらにも配列を指定できる)
	{
		x := []int{1, 2, 3, 4}
		d := [4]int{5, 6, 7, 8}
		y := make([]int, 2)
		copy(y, d[:])
		fmt.Println(y) // [5 6]
		copy(d[:], x)
		fmt.Println(d) // [1 2 3 4]
	}
	// 配列 → スライスの変換: [:]の構文を利用する
	{
		xArray := [4]int{5, 6, 7, 8}
		xSlice := xArray[:]
		fmt.Println(xSlice) // [5 6 7 8]

		ySlice := xArray[:2]
		zSlice := xArray[2:]
		fmt.Println(ySlice, zSlice) // [5 6] [7 8]
	}
	// ただし，配列 → スライスの変換でも記憶領域の共有は起こる
	{
		x := [4]int{5, 6, 7, 8}
		y := x[:2]
		z := x[2:]
		x[0] = 10
		fmt.Println("x: ", x) // x: [10 6 7 8]
		fmt.Println("y: ", y) // y: [10 6]
		fmt.Println("z: ", z) // z: [7 8]
	}
	// 逆にスライス → 配列の変換は型変換で実現する
	// スライスの長さより長い配列には変換できない (実行時パニックになる)
	{
		xSlice := []int{1, 2, 3, 4}
		xArray := [4]int(xSlice)
		smallArray := [2]int(xSlice)
		xSlice[0] = 10
		fmt.Println(xSlice)     // [10 2 3 4]
		fmt.Println(xArray)     // [1 2 3 4]
		fmt.Println(smallArray) // [1 2]
		// ↓ は実行時パニックになる
		// panicArray := [5]int(xSlice) // panic: runtime error: cannot convert slice with length 4 to array or pointer to array with length 5
		// fmt.Println(panicArray)
	}
	// ポインタ (6章でやる) を利用してスライス → 配列のポインタへの型変換ができる
	// ポインタなので，記憶領域は共有される
	{
		xSlice := []int{1, 2, 3, 4}
		xArrayPointer := (*[4]int)(xSlice)
		fmt.Println("xArrayPointer: ", xArrayPointer) // xArrayPointer:  &[1 2 3 4]
		xSlice[0] = 10
		xArrayPointer[1] = 20
		fmt.Println("xSlice: ", xSlice)               // xSlice: [10 20 3 4]
		fmt.Println("xArrayPointer: ", xArrayPointer) // xArrayPointer:  &[10 20 3 4]
	}
	// 関数の引数として配列を渡す場合に長さが異なる場合は引数に配列を指定できない
	// スライスを介して配列の長さを変えることで，その制約を回避できる (ただし何度も繰り返すようならば，配列ではなくスライスを受け渡すよう変更すべきである)

	// 文字列: Goの文字列はバイト列であり，runeの配列 (スライス) ではない
	//   - Goのライブラリ関数ではUTF-8のコードポイントのバイト列であることが仮定されていることがある
	//   - Goではソースコード自体はUTF-8で書かなければならない
	//   - 文字列リテラルはUTF-8で書かれる (例外として16進エスケープでの記述がある)
	// 文字列から文字を抽出するにはインデックスやスライス式を利用する
	{
		var s string = "Hello there"
		//              01234567890
		var b byte = s[6]
		fmt.Println("b:", b)              // b: 116
		fmt.Printf("b (%%cを指定): %c\n", b) // b (%cを指定): t
		var c rune = rune(s[6])
		fmt.Println("c:", c)              // c: 116
		fmt.Printf("c (%%cを指定): %c\n", c) // c (%cを指定): t

		var s2 string = s[4:7] // スライス式
		var s3 string = s[:5]
		var s4 string = s[6:]
		fmt.Println(s2) // "o t"
		fmt.Println(s3) // "Hello"
		fmt.Println(s4) // "there"
	}
	// 日本語のような多バイト文字を含む文字列では注意が必要
	//   * 1バイト文字しか使われていない場合だけ，文字列に対してインデックスやスライスしたりすること
	{
		var s string = "Hello ☀"
		var s2 string = s[4:7]
		var s3 string = s[:5]
		var s4 string = s[6:]
		fmt.Println(s)                 // "Hello ☀"
		fmt.Println(s2)                // "o �" (文字化け)
		fmt.Println(s3)                // "Hello"
		fmt.Println(s4)                // "☀"
		fmt.Println("len(s):", len(s)) // len(s): 9 (太陽の絵文字「☀」は3バイト)
	}
	{
		var s string = "こんにちは"
		fmt.Println("s:", s)       // s: こんにちは
		fmt.Println("s[0]:", s[0]) // s[0]: 227
		var b byte = s[6]
		fmt.Println("b:", b) // b: 227
		var c rune = rune(s[6])
		fmt.Println("c:", c) // c: 227
	}
	{
		var s string = "こんにちは、みなさん"
		var s2 string = s[4:7]
		var s3 string = s[:5]
		var s4 string = s[6:]
		fmt.Println("s:", s)   // s: こんにちは、みなさん
		fmt.Println("s2:", s2) // s2: ���
		fmt.Println("s3:", s3) // s3: こ�
		fmt.Println("s4:", s4) // s4: にちは、みなさん
	}
	// rune，文字列，バイトの間は型変換ができる
	// 1. runeまたはバイトは文字列に変換できる (intはstringに変換できない; 65 -> "65"ではなく"A"になる)
	{
		var a rune = 'x'
		var s string = string(a)
		var b byte = 'y'
		var s2 string = string(b)
		fmt.Println(s, s2) // x y

		var x int = 65
		var y = string(x) // conversion from int to string yields a string of one rune, not a string of digits
		fmt.Println(y)    // A
	}
	// 2. 文字列はruneまたはバイトのスライスに変換できる (逆も可能)
	{
		var s string = "Hello, 🌞"
		var bs []byte = []byte(s)
		var rs []rune = []rune(s)
		fmt.Println(bs) // [72 101 108 108 111 44 32 240 159 140 158]
		fmt.Println(rs) // [72 101 108 108 111 44 32 127774]
	}
	// 文字列に対してはスライスやインデックスではなく，標準パッケージ (stringsやunicode/utf8) の関数を使うことが推奨される

	// マップ: キーと値の組み合わせでデータ間のランダムな関連を表現する
	// map[キーの型]値の型 の形で宣言する
	{
		var nilMap map[string]int  // ゼロ値はnil
		fmt.Println(len(nilMap))   // 0
		fmt.Println(nilMap["abc"]) // 0 (存在しないキーにアクセスしてもパニックにはならない)
		// ↓ は実行時パニックになる
		// nilMap["abc"] = 3 // panic: assignment to entry in nil map
	}
	// 多くの場合，:=とマップリテラルで変数宣言する
	{
		totalWins := map[string]int{} // 空のマップで初期化
		fmt.Println(totalWins == nil) // false
		fmt.Println(totalWins["abc"]) // 0
		totalWins["abc"] = 3
		fmt.Println(totalWins["abc"]) // 3
	}
	// マップリテラル: { と } の中に 「キー: 値」の形式で記述し，カンマで区切る (末尾カンマもある)
	// make(マップの型, キャパシティ) でマップを作成することもできる
	{
		teams := map[string][]string{
			"ライターズ":    []string{"夏目", "森", "国木田"},
			"ナイツ":      []string{"武田", "徳川", "明知"},
			"ミュージシャンズ": []string{"ラベル", "ベートーベン", "リスト"},
		}
		ages := make(map[string]int, 10)
		fmt.Println(teams, ages)
	}
	// マップのまとめ
	//   - 新たな「キーと値のペア」を指定することで大きくできる
	//   - 関数lenを使うと「キーと値のペア」の個数がわかる
	//   - 関数makeでキャパシティを指定できる
	//   - ゼロ値はnilである
	//   - マップは比較できない (nilとの比較はできる)
	//   - キーとして使える型は比較可能な型に限られる (スライスやマップはキーにはできない)
	//   - マップはハッシュマップ (ハッシュテーブル) として実装されている (ハッシュ関数はGoのランタイムに含まれている)
	// マップmのキーkに対応する値はm[k]で取得でき，m[k] = vで新たな値に設定できる (:=は使えない)
	// 存在しないキーを取得しようとすると，値の型のゼロ値が返される
	{
		totalWins := map[string]int{} // 合計勝利数
		totalWins["ライターズ"] = 1
		totalWins["ナイツ"] = 2
		fmt.Println(totalWins["ライターズ"])    // 1
		fmt.Println(totalWins["ミュージシャンズ"]) // 0
		totalWins["ミュージシャンズ"]++
		fmt.Println(totalWins["ミュージシャンズ"]) // 1
		totalWins["ナイツ"] = 3
		fmt.Println(totalWins["ナイツ"]) // 3
	}
	// カンマokイディオム: (マップでは) キーが存在しないからゼロ値が返されたのか，実際にゼロ値が格納されているのかを区別する方法
	// v, ok := m[k] の形で書き，okにはキーkが存在するかどうかがbool値で入る
	// (カンマokイディオムは型アサーションやチャネルでも使われる)
	{
		m := map[string]int{
			"hello": 5,
			"world": 0,
		}
		v, ok := m["hello"]
		fmt.Println(v, ok) // 5 true
		v, ok = m["world"]
		fmt.Println(v, ok) // 0 true
		v, ok = m["goodbye"]
		fmt.Println(v, ok) // 0 false
	}
	// 組み込み関数delete: マップからキーと値のペアを削除する
	// deleteは，マップ自体がnilの場合やマップにキーが存在しない場合は何もしない
	{
		m := map[string]int{
			"hello": 5,
			"world": 0,
		}
		delete(m, "hello")
	}
	// マップのクリア: 関数clearはマップにも使える
	// クリアされたマップは長さが0になる (スライスはクリアしても長さが変わらない)
	{
		m := map[string]int{
			"hello": 5,
			"world": 10,
		}
		fmt.Println(m, len(m)) // map[hello:5 world:10] 2
		clear(m)
		fmt.Println(m, len(m)) // map[] 0
	}
	// マップの比較: マップは単純に演算子による比較はできない
	// map.Equal, map.EqualFuncなどの関数を使ってマップを比較する
	{
		m := map[string]int{
			"hello": 5,
			"world": 10,
		}
		n := map[string]int{
			"hello": 5,
			"world": 10,
		}
		fmt.Println(maps.Equal(m, n)) // true
	}
	// 集合(セット)をマップを使って表現する
	// スライスにある値が含まれるか否かは線型オーダーだが，マップを使うと定数時間で判定できる
	// 以下では含まれる値にはtrueを対応させることで集合を表現している
	{
		intSet := map[int]bool{}
		vals := []int{5, 10, 2, 5, 8, 7, 3, 9, 1, 2, 10}
		for _, v := range vals {
			intSet[v] = true
		}
		fmt.Println(len(vals), len(intSet)) // 11 8
		fmt.Println(intSet[5])              // true
		fmt.Println(intSet[500])            // false
		if intSet[100] {
			fmt.Println("100は含まれている")
		}
		if intSet[10] {
			fmt.Println("10は含まれている")
		}
	}
	// boolのかわりに空の構造体を使う方法もある (boolは1バイトだが，空の構造体は0バイトであるため)
	// ただしコードの複雑さが大きくなる
	{
		intSet := map[int]struct{}{}
		vals := []int{5, 10, 2, 5, 8, 7, 3, 9, 1, 2, 10}
		for _, v := range vals {
			intSet[v] = struct{}{}
		}
		if _, ok := intSet[5]; ok {
			fmt.Println("5は含まれている")
		}
		if _, ok := intSet[500]; ok {
			fmt.Println("500は含まれている")
		}
	}

	// 構造体: マップは一般的過ぎるので，データ構造を定義するには構造体を用いる
	//   - type 構造体名 struct { フィールド名 フィールドの型 ...  } の形で定義する (カンマは不要)
	//   - 構造体は関数の内側でも外側でも定義できるが，関数の内側で定義されるとその関数内でしか使えない
	// 構造体を型としてもつ変数を定義できる
	//   - 変数を代入せず初期化すると各フィールドにゼロ値が入る
	//   - 構造体リテラルは2つの形で書ける
	//       1. フィールドの定義順位で値を並べる
	//       2. フィールド名: 値 の形でフィールド名を明示する
	// 構造体のフィールドへアクセスするにはドット(.)を使う
	{
		type person struct {
			name string // 名前
			age  int    // 年齢
			pet  string // ペット
		}
		var fred person   // 構造体 person の各フィールドにゼロ値が入る
		fmt.Println(fred) // { 0  }
		bob := person{}
		julia := person{
			"ジュリア", // name
			40,     // age
			"cat",  // pet
		}
		fmt.Println(julia) // {ジュリア 40 cat}
		beth := person{
			age:  30,
			name: "ベス",
		}
		fmt.Println(beth) // {ベス 30  }
		bob.name = "ボブ"
		fmt.Println(bob.name) // ボブ
	}
	// 無名構造体: 名前のない構造体
	//   - 無名構造体を利用されやすいとき
	//     1. JSONなどの外部データを構造体に変換 (アンマーシャリング) したり，逆にマーシャリングするとき
	//     2. テストを記述するとき
	{
		// 変数 person を無名構造体で定義する
		var person struct {
			name string
			age  int
			pet  string
		}
		person.name = "ボブ"
		person.age = 50
		person.pet = "dog"
		fmt.Println(person) // {ボブ 50 dog}

		// 変数 pet を無名構造体で定義する
		pet := struct {
			name string
			king string
		}{
			name: "ポチ",
			king: "dog",
		}
		fmt.Println(pet) // {ポチ dog}
	}
	// 構造体はすべてのフィールドが比較可能ならば構造体も比較可能であり，そうでなければ比較不可能である
	//   - 等価性判断の演算子をオーバーライドすることはできない (関数を自作して比較する)
	// 構造体を型変換できるのは，全フィールドの名前，型，順番が同じときである
	//   - ただし，型変換ができる場合でも比較はできない
	{
		type firstPerson struct {
			name string
			age  int
		}
		type secondPerson struct {
			name string
			age  int
		}
		var person1 firstPerson
		var person2 secondPerson
		// ↓ はコンパイルできない
		// fmt.Println(person1 == person2)
		var person2a = secondPerson(person1)
		fmt.Println(person2 == person2a) // true

		type thirdPerson struct {
			age  int
			name string
		}
		// ↓ はコンパイルできない (順番が異なる)
		// var person3 = thirdPerson(person1)

		type fourthPerson struct {
			firstName string
			age       int
		}
		// ↓ はコンパイルできない (名前が異なる)
		// var person4 = fourthPerson(person1)

		type fifthPerson struct {
			age           int
			name          string
			favoriteColor string // 好きな色
		}
		// ↓ はコンパイルできない (フィールドが追加されている)
		// var person5 = fifthPerson(person1)
	}
	// 無名構造体の比較はすべてのフィールドが同じ名前，型，順番ならばできる
	// 無名構造体と名前付き構造体の間でも同じことが言える
	{
		type firstPerson struct {
			name string
			age  int
		}
		f := firstPerson{
			name: "Bob",
			age:  50,
		}
		var g struct {
			name string
			age  int
		}
		g = f
		fmt.Println(f == g) // true
	}
}
